maze = [

    ["#", "#", "#", "#", "#", "#", "#", "#", "#", "#", "#", "#", "#", "#", "#", "#", " ", "0"  " ", " #"],

    ["#", " ", " ", " ", " ", " ", " ", " #", " ", " ", " ", " ", "#", " ",  " ", " ", " ", "#", "#", "#"],

    ["#", " ", " ", "#", "#", "#", " ", " ",  " ", " ", " #", "#", "#",  " ",  " ", " #", "#", "#", "#", " "],

    ["#", " ", " ", "#", " ", " ", "#", " ", " ",  " ", " ", " ", " ", " ", " ", " ", " #", "#", "#", "#"],

    ["#", " ",  " ", "#", " ", " ", " ", " ",  " ", " ", " #", "#", "#", "#", "#", "#", "#", "#", "#", "#"],

    ["#", " ", " #", " ", " ",  "#", "#", " ",  " ", " ", " ", " ", " ", " ", " ", " ", "#", "#", "#", "#"],

    ["#", " ", " #", " ",  " #", "#", "#", "#", "#", "#", "#", " ", " ", " ", " #", "#", "#", "#"],

    ["#", " ",  " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ",  " ",  " ",  " ", " #", "#", "#", "#"],

    [ "E", " ", " ", "#", "#", "#", "#", "#", "#", "#", "#", "#", "#", "#", "#", "#", "#", "#", "#", "#",]

]

def find_exit(maze, x, y):
    print('Игрок: "E", управление "WASD", для выхода из программы напишите "Выход"')
    step = str(input())
    while not(step == 'Выход'):
        
        if x == 18 and y == 9:
            print("Победа!")
            break

        if step == 'W':
            print(f'X: {x}, Y: {y}')
            return find_exit(maze, x, (y + 1))
        
        elif step == 'S':
            print(f'X: {x}, Y: {y}')
            return find_exit(maze, x, (y - 1))
        
        elif step == 'D':
            print(f'X: {x}, Y: {y}')
            return find_exit(maze, (x + 1), y)
        
        elif step == 'A':
            print(f'X: {x}, Y: {y}')
            return find_exit(maze, (x - 1), y)

        elif step != 'A' or step != 'D' or step != 'S' or step != 'W':
            print('Вы ввели неверную комманду!')
            return find_exit(maze, x, y)
        
                
def print_maze(maze):
    for row in maze:
        print(''.join(row))


find_exit(maze, 0, 0)
print_maze(maze)